Revit 2027 API
PointCloudOverrideSettings.ColorMode Property
 The current color mode for the PointCloudInstance element or its scan.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointCloudColorMode ColorMode { get; set; }
Public Property ColorMode As PointCloudColorMode
	Get
	Set
public:
property PointCloudColorMode ColorMode {
	PointCloudColorMode get ();
	void set (PointCloudColorMode value);
}
member ColorMode : PointCloudColorMode with get, set
Property Value
PointCloudColorMode
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PointCloudOverrideSettings Class
Autodesk.Revit.DB.PointClouds Namespace